Emacs.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/dotfiles/init.el


* Package System Setup

#+begin_src emacs-lisp


  ;; MELPA
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))


  (package-initialize)
  ;;(unless package-archive-contents
  ;;  (package-refresh-contents))

  ;;(require 'use-package)
  ;;'(setq use-package-always-ensure t)


#+end_src


* Basic UI Configuration

Simplify the UI

#+begin_src emacs-lisp

  ;; Simplify the UI
  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room
  (menu-bar-mode -1)          ; Disable the menu bar


  ;; Set up the visible bell
  (setq ring-bell-function 'ignore)
  (setq sentence-end-double-space nil)

#+end_src

Fonts

#+begin_src emacs-lisp

  ;; Set the fixed pitch face
  (set-face-attribute 'default nil :height 150) ;; 15pt font

  ;; Set the variable pitch face
  ;;(set-face-attribute 'variable-pitch nil :font "Inter" :height 175 :weight 'regular)
  ;(set-face-attribute 'variable-pitch nil :font "Lucida Grande" :height 175 :weight 'regular)
  (set-face-attribute 'variable-pitch nil :height 175 :weight 'regular)

#+end_src

No Backup files

#+begin_src emacs-lisp
  (setq make-backup-files nil) ;turn off the backup files
#+end_src

Copy and paste

#+begin_src emacs-lisp

  (setq save-interprogram-paste-before-kill t)
  ;;(setq select-enable-clipboard t)
  (setq select-enable-clipboard nil)

  ;; Make cut and paste work with the macOS clipboard
  (defun yank-from-osx-clipboard ()
    "Insert the contents of the macOS clipboard at point."
    (interactive)
    (insert (shell-command-to-string "pbpaste")))

  (global-set-key (kbd "s-v") 'yank-from-osx-clipboard)

#+end_src

Copy the current region to the clipboard.  Bound to =C-c e=

#+begin_src emacs-lisp

  (defun copy-region-to-pbcopy ()
    "Copy the current region to the clipboard using pbcopy."
    (interactive)
    (if (use-region-p)
        (progn
          (shell-command-on-region (region-beginning) (region-end) "pbcopy")
          (deactivate-mark) ; Optionally deactivate the mark
          (message "Region copied to clipboard using pbcopy!"))
      (message "No active region!")))


  (global-set-key "\C-ce" 'copy-region-to-pbcopy)

#+end_src


* UI Configuration

** Scolling

#+begin_src emacs-lisp

  (defalias 'scroll-ahead `scroll-up)
  (defalias 'scroll-behind `scroll-down)

  (defun scroll-n-lines-ahead (&optional n)
    "Scroll ahead N lines (1 by default)."
    (interactive "P")
    (scroll-ahead (prefix-numeric-value n)))

  (defun scroll-n-lines-behind (&optional n)
    "Scroll behind N lines (1 by default)."
    (interactive "P")
    (scroll-behind (prefix-numeric-value n)))


  (global-set-key "\C-q" 'scroll-n-lines-behind)
  (global-set-key "\C-x\C-q" 'quoted-insert)
  (global-set-key "\C-z" 'scroll-n-lines-ahead)


  (defun point-to-top ()
    "Put point on the top line of window"
    (interactive)
    (move-to-window-line 0))

  (defun point-to-bottom ()
    "Put point on the top line of window"
    (interactive)
    (move-to-window-line -1))

  (defun line-to-top ()
    "Move the current line to top of window."
    (interactive)
    (recenter 0))


  (global-set-key "\M-," 'point-to-top)
  (global-set-key "\M-." 'point-to-bottom)
  (global-set-key "\M-!" 'line-to-top)

#+end_src

Save hist

#+begin_src emacs-lisp

  (use-package savehist
    :init
    (savehist-mode))

#+end_src


* Key bindings

#+begin_src emacs-lisp

  (global-set-key "\C-h" 'delete-backward-char)
  (global-set-key (kbd "C-?") 'help-command)
  (global-set-key "\M-h" 'backward-kill-word)
  ;;(global-set-key "\M-w" 'ispell-word)
  (global-set-key "\M-#" 'ispell-region)

  ;;(global-set-key "\C-l" 'goto-line)
  (global-set-key "\M-n" 'forward-paragraph)
  (global-set-key "\M-p" 'backward-paragraph)

  (global-set-key (kbd "C-c r") 'revert-buffer-quick)
  (global-set-key "\M-?" 'help-command)
  (global-set-key (kbd "<backtab>") 'dabbrev-expand)

#+end_src


* Which key

[[https://github.com/justbur/emacs-which-key][which-key]]  is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix. For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run. This is very useful for learning the possible key bindings in the mode of your current buffer. The =which-key-idle-delay= sets how long until the pannel shows

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src


* Counsel

Counsel is a customized set of commands to replace `find-file` with `counsel-find-file`, etc which provide useful commands for each of the default completion commands.

#+begin_src emacs-lisp

  (use-package counsel
    :bind (("M-X" . counsel-M-x)
           ("C-x B" . counsel-ibuffer)
  	 ;;("C-x F" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)))

#+end_src


* Helpful

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful information to Emacs’ describe- command buffers. For example, if you use describe-function, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration. It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))


#+end_src


* Buffers

** Check Buffer before switching

#+begin_src emacs-lisp

  					; Check buffer exists before switching there
  (defadvice switch-to-buffer (before existing-buffer
  				    activate compile)
    "When interactive, swtich to existing buffers only,
     unless given a prefex argument."
    (interactive
     (list (read-buffer "Switch to buffer: "
  		      (other-buffer)
  		      (null current-prefix-arg)))))


#+end_src

** Buffer placement

#+begin_src emacs-lisp


  (setq display-buffer-alist
        '(

  	;; Anatomy of a an entry:
  	;; (BUFFER-MATCHER
  	;;  LIST-OF-DISPLAY-ACTIONS
  	;;  &optional PARAMETERS)

  	("\\*Org todo\\*"
  	 ;; list of display functions
  	 (display-buffer-reuse-window
  	  display-buffer-below-selected)
  	 ;; Parameters
  	 (window-height . fit-window-to-buffer)
  	 (dedicated . t)
  	 )

  	("\\*wclock\\*"
  	 ;; list of display functions
  	 (display-buffer-reuse-window
  	  display-buffer-below-selected)
  	 ;; Parameters
  	 (window-height . fit-window-to-buffer)
  	 (dedicated . t)
  	 )

  	
  	))

#+end_src


Ediff

#+begin_src emacs-lisp

  (setq ediff-window-setup-function 'ediff-setup-windows-plain)

#+end_src


* Text Editing 

Whitespace

#+begin_src emacs-lisp


  (defun replace-blank-lines-with-true-blanks ()
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward "^[ \t]+$" nil t)
        (replace-match "" nil nil))))

  (defun remove-trailing-whitespace ()
    (interactive)
    (when (derived-mode-p 'python-mode 'emacs-lisp-mode)
      (delete-trailing-whitespace)))

  (add-hook 'before-save-hook 'remove-trailing-whitespace)


#+end_src


* Copilot

https://github.com/copilot-emacs/copilot.el

#+begin_src emacs-lisp

  ;; Setting up copilot
  (add-to-list 'load-path "~/emacs/copilot.el")
  (require 'editorconfig)
  (require 'copilot)
  (add-hook 'prog-mode-hook 'copilot-mode)
  (define-key copilot-completion-map (kbd "<backtab>") 'copilot-accept-completion)
  (define-key copilot-completion-map (kbd "C-c C-f") 'copilot-accept-completion-by-word)
  (define-key copilot-completion-map (kbd "C-<tab>") 'copilot-accept-completion-by-word)
  (define-key copilot-completion-map (kbd "C-M-<tab>") 'copilot-accept-completion-by-line)  

  (define-key copilot-completion-map (kbd "M-p") 'copilot-previous-completion)
  (define-key copilot-completion-map (kbd "M-n") 'copilot-next-completion)
  (define-key copilot-completion-map (kbd "C-g") 'copilot-clear-overlay)

  (setq warning-suppress-types '((copilot)))

#+end_src


Chat: https://github.com/chep/copilot-chat.el
 
Automatically make git commit messages.

#+begin_src emacs-lisp

  (add-hook 'git-commit-setup-hook 'copilot-chat-insert-commit-message)
  (global-set-key (kbd "C-c c") 'copilot-chat-transient)

#+end_src


