init.el
;; MELPA
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))


(package-initialize)
;;(unless package-archive-contents
;;  (package-refresh-contents))

;;(require 'use-package)
;;'(setq use-package-always-ensure t)

;; Simplify the UI
(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room
(menu-bar-mode -1)          ; Disable the menu bar


;; Set up the visible bell
(setq ring-bell-function 'ignore)
(setq sentence-end-double-space nil)

;; Set the fixed pitch face
(set-face-attribute 'default nil :height 150) ;; 15pt font

;; Set the variable pitch face
;;(set-face-attribute 'variable-pitch nil :font "Inter" :height 175 :weight 'regular)
;(set-face-attribute 'variable-pitch nil :font "Lucida Grande" :height 175 :weight 'regular)
(set-face-attribute 'variable-pitch nil :height 175 :weight 'regular)

(setq make-backup-files nil) ;turn off the backup files

(setq save-interprogram-paste-before-kill t)
;;(setq select-enable-clipboard t)
(setq select-enable-clipboard nil)

;; Make cut and paste work with the macOS clipboard
(defun yank-from-osx-clipboard ()
  "Insert the contents of the macOS clipboard at point."
  (interactive)
  (insert (shell-command-to-string "pbpaste")))

(global-set-key (kbd "s-v") 'yank-from-osx-clipboard)

(defun copy-region-to-pbcopy ()
  "Copy the current region to the clipboard using pbcopy."
  (interactive)
  (if (use-region-p)
      (progn
        (shell-command-on-region (region-beginning) (region-end) "pbcopy")
        (deactivate-mark) ; Optionally deactivate the mark
        (message "Region copied to clipboard using pbcopy!"))
    (message "No active region!")))


(global-set-key "\C-ce" 'copy-region-to-pbcopy)

(defalias 'scroll-ahead `scroll-up)
(defalias 'scroll-behind `scroll-down)

(defun scroll-n-lines-ahead (&optional n)
  "Scroll ahead N lines (1 by default)."
  (interactive "P")
  (scroll-ahead (prefix-numeric-value n)))

(defun scroll-n-lines-behind (&optional n)
  "Scroll behind N lines (1 by default)."
  (interactive "P")
  (scroll-behind (prefix-numeric-value n)))


(global-set-key "\C-q" 'scroll-n-lines-behind)
(global-set-key "\C-x\C-q" 'quoted-insert)
(global-set-key "\C-z" 'scroll-n-lines-ahead)


(defun point-to-top ()
  "Put point on the top line of window"
  (interactive)
  (move-to-window-line 0))

(defun point-to-bottom ()
  "Put point on the top line of window"
  (interactive)
  (move-to-window-line -1))

(defun line-to-top ()
  "Move the current line to top of window."
  (interactive)
  (recenter 0))


(global-set-key "\M-," 'point-to-top)
(global-set-key "\M-." 'point-to-bottom)
(global-set-key "\M-!" 'line-to-top)

(use-package savehist
  :init
  (savehist-mode))

(global-set-key "\C-h" 'delete-backward-char)
(global-set-key (kbd "C-?") 'help-command)
(global-set-key "\M-h" 'backward-kill-word)
;;(global-set-key "\M-w" 'ispell-word)
(global-set-key "\M-#" 'ispell-region)

;;(global-set-key "\C-l" 'goto-line)
(global-set-key "\M-n" 'forward-paragraph)
(global-set-key "\M-p" 'backward-paragraph)

(global-set-key (kbd "C-c r") 'revert-buffer-quick)
(global-set-key "\M-?" 'help-command)
(global-set-key (kbd "<backtab>") 'dabbrev-expand)

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

(use-package counsel
  :bind (("M-X" . counsel-M-x)
         ("C-x B" . counsel-ibuffer)
	 ;;("C-x F" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)))

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

; Check buffer exists before switching there
(defadvice switch-to-buffer (before existing-buffer
				    activate compile)
  "When interactive, swtich to existing buffers only,
   unless given a prefex argument."
  (interactive
   (list (read-buffer "Switch to buffer: "
		      (other-buffer)
		      (null current-prefix-arg)))))

(setq display-buffer-alist
      '(

	;; Anatomy of a an entry:
	;; (BUFFER-MATCHER
	;;  LIST-OF-DISPLAY-ACTIONS
	;;  &optional PARAMETERS)

	("\\*Org todo\\*"
	 ;; list of display functions
	 (display-buffer-reuse-window
	  display-buffer-below-selected)
	 ;; Parameters
	 (window-height . fit-window-to-buffer)
	 (dedicated . t)
	 )

	("\\*wclock\\*"
	 ;; list of display functions
	 (display-buffer-reuse-window
	  display-buffer-below-selected)
	 ;; Parameters
	 (window-height . fit-window-to-buffer)
	 (dedicated . t)
	 )

	
	))

(setq ediff-window-setup-function 'ediff-setup-windows-plain)

(defun replace-blank-lines-with-true-blanks ()
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "^[ \t]+$" nil t)
      (replace-match "" nil nil))))

(defun remove-trailing-whitespace ()
  (interactive)
  (when (derived-mode-p 'python-mode 'emacs-lisp-mode)
    (delete-trailing-whitespace)))

(add-hook 'before-save-hook 'remove-trailing-whitespace)

;; Setting up copilot
(add-to-list 'load-path "~/emacs/copilot.el")
(require 'editorconfig)
(require 'copilot)
(add-hook 'prog-mode-hook 'copilot-mode)
(define-key copilot-completion-map (kbd "<backtab>") 'copilot-accept-completion)
(define-key copilot-completion-map (kbd "C-c C-f") 'copilot-accept-completion-by-word)
(define-key copilot-completion-map (kbd "C-<tab>") 'copilot-accept-completion-by-word)
(define-key copilot-completion-map (kbd "C-M-<tab>") 'copilot-accept-completion-by-line)  

(define-key copilot-completion-map (kbd "M-p") 'copilot-previous-completion)
(define-key copilot-completion-map (kbd "M-n") 'copilot-next-completion)
(define-key copilot-completion-map (kbd "C-g") 'copilot-clear-overlay)

(setq warning-suppress-types '((copilot)))

(add-hook 'git-commit-setup-hook 'copilot-chat-insert-commit-message)
(global-set-key (kbd "C-c c") 'copilot-chat-transient)
