init.el

;; Setting up gptel
;; (add-to-list 'load-path "~/emacs/gptel")

(use-package gptel
  :ensure t
  :config
  ;; either hard‑code it (not recommended for shared configs):
  ;;(setq gptel-api-key "sk‑YOUR_SECRET_KEY_HERE")

  ;; or, read from your shell’s env var:
  (setq gptel-api-key (getenv "OPENAI_API_KEY")))


(add-to-list 'gptel-directives '(dict . "Provide synonyms for the word I provide. Respond with a list of words separated by commas; respond in one line."))
(add-to-list 'gptel-directives '(math . "I want you to act like a mathematician. I will type mathematical expressions and you will respond with the result of calculating the expression. I want you to answer only with the final amount and nothing else. Do not write explanations. When I need to tell you something in English, I'll do it by putting the text inside square brackets {like this}."))

(global-set-key (kbd "C-c g") 'gptel-send)
(global-set-key (kbd "C-c m") 'gptel-menu)


(defun gptel-send-with-options (&optional arg)
  "Send query.  With prefix ARG open gptel's menu instead."
  (interactive "P")
  (if arg
      (call-interactively 'gptel-menu)
    (gptel--suffix-send (transient-args 'gptel-menu))))


;; Optional defaults
(setq gptel-use-tools t                 ; allow tool use by default
      gptel-confirm-tool-calls nil        ; ask before each invocation
      gptel-include-tool-results nil)     ; echo results back to the model


(gptel-make-preset 'proofreading
  :description "Preset for proofreading tasks"
  :system "Please copy edit this text. The replace will applied in place so only return the edited text."
  :use-context 'system)

(defvar gptel-lookup--history nil)

(defun gptel-lookup (prompt)
  (interactive (list (read-string "Ask ChatGPT: " nil gptel-lookup--history)))
  (when (string= prompt "") (user-error "A prompt is required."))
  (gptel-request
      prompt
    :system "You LLM living in Emacs and a helpful assistant. Be concise"      ;; <- Your system directive here
    :callback
    (lambda (response info)
      (if (not response)
          (message "gptel-lookup failed with message: %s" (plist-get info :status))
	(with-current-buffer (get-buffer-create "*gptel-lookup*")
          (let ((inhibit-read-only t))
            (erase-buffer)
            (insert response))
          (special-mode)
          (display-buffer (current-buffer)
                          `((display-buffer-in-side-window)
                            (side . bottom)
                            (window-height . ,#'fit-window-to-buffer))))))))

(use-package vertico
  :ensure t
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))


(keymap-set vertico-map "?" #'minibuffer-completion-help)
(keymap-set vertico-map "M-RET" #'minibuffer-force-complete-and-exit)
(keymap-set vertico-map "M-TAB" #'minibuffer-complete)
(keymap-set vertico-map "TAB" #'minibuffer-complete)

(use-package marginalia
  :after vertico
  :ensure t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))

(use-package orderless
  :ensure t
  :config
  (setq completion-styles '(orderless basic)))

(use-package consult
  :ensure t
  :bind (;; A recursive grep
         ("M-s g" . consult-grep)
         ;; Search for files names recursively
         ("M-s f" . consult-find)
         ;; Search through the outline (headings) of the file
         ("M-s M-o" . consult-outline)
         ;; Search the current buffer
         ("M-s M-l" . consult-line)
         ;; Switch to another buffer, or bookmarked file, or recently
         ;; opened file.
         ("M-s b" . consult-buffer)))

(use-package embark
  :ensure t

  :bind
  (("C-." . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ;("C-h B" . embark-bindings) ;; alternative for `describe-bindings'
   ) 

  :init

  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  :config

  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))


;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :ensure t ; only need to install it, embark loads it after consult if found
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

(use-package magit
  :ensure t)

(use-package dired
  :ensure nil              ;; dired is built-in
  :bind (:map dired-mode-map
              ("b" . dired-up-directory))
  :custom ((insert-directory-program "gls")
	   (dired-listing-switches "-agho --group-directories-first")
	   ;;(dired-dwim-target t)
	   ;;(dired-recursive-copies 'always)
	   ;;(dired-recursive-deletes 'top)
	   )
  )


(with-eval-after-load 'dired
  (require 'dired-x))

(use-package dired-open
  :config
  ;; Doesn't work as expected!
  (add-to-list 'dired-open-functions #'dired-open-xdg t)
  ;; -- OR! --
  (setq dired-open-extensions '(("key" . "open")
				("docx". "open")
				("xlsx". "open")
				("pdf" . "open"))))


(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :bind(:map dired-mode-map
	("H" . dired-hide-dotfiles-mode)
  ))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
