Emacs.org
* Tramps

LPC

#+begin_src emacs-lisp

  (setq remote-lpc-coffea4bees-path "/ssh:jda102@cmslpc-el9.fnal.gov:/uscms/home/jda102/nobackup/HH4b/Run3/coffea4bees/")

  ;; Example of using the variable
  (defun open-lpc-coffea4bees ()
    "Open the remote HH4b directory on the LPC."
    (interactive)
    (find-file remote-lpc-coffea4bees-path))
    
#+end_src

Falcon

#+begin_src emacs-lisp

  (setq remote-falcon-coffea4bees-path "/ssh:jalison@falcon.phys.cmu.edu:/home/export/jalison/work/coffea4bees/python")

  ;; Example of using the variable
  (defun open-falcon-coffea4bees ()
    "Open the remote HH4b directory on falcon.phys.cmu.edu"
    (interactive)
    (find-file remote-falcon-coffea4bees-path))


#+end_src

  
* Org Mode

[[https://orgmode.org/][Org Mode]] is one of the hallmark features of Emacs. It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

** Better Fonts


The efs/org-font-setup function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we’re editing a document in org-mode. We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    ;(font-lock-add-keywords 'org-mode
    ;			  '(("^ *\\([-]\\) "
    ;			     (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))


    ;; Set faces for heading levels with colors
    ;;(set-face-attribute 'org-level-1 nil :font "Lucida Grande" :weight 'bold    :height 1.1 :foreground "#8350ef")
    ;;;;;(set-face-attribute 'org-level-1 nil :font "Lucida Grande" :weight 'bold    :height 1.1 :foreground "mediumblue")
    ;;;;;(set-face-attribute 'org-level-2 nil :font "Lucida Grande" :weight 'bold    :height 1.1 ) 
    ;;;;;(set-face-attribute 'org-level-3 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
    ;;;;;(set-face-attribute 'org-level-4 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
    ;;;;;(set-face-attribute 'org-level-5 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
    ;;;;;(set-face-attribute 'org-level-6 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
    ;;;;;(set-face-attribute 'org-level-7 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
    ;;;;;(set-face-attribute 'org-level-8 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit '(shadow fixed-pitch) :height 1.0)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch) :height 0.9)
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    )

#+end_src


** Basic Config

This section contains the basic configuration for org-mode plus the configuration for Org agendas and capture templates.

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    ;;(setq-default line-spacing 0.5) ;; 0.2 means 20% extra space
    (visual-line-mode 1))


  (use-package org
    :hook (org-mode . efs/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-agenda-files
    	'("~/RoamNotes/Tasks.org"
    	  "~/RoamNotes/Mail.org"
    	  "~/RoamNotes/Archive.org"
    	  "~/RoamNotes/Birthdays.org"
    	  "~/RoamNotes/gcal.org"
    	  ))
    (setq org-hide-emphasis-markers t)
    (setq org-hide-block-startup t)
    (efs/org-font-setup)

    (setq org-insert-heading-respect-content t)
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)


    (setq org-todo-keywords
    	'((sequence "TODO(t)" "The ONE thing(o)" "Now(n)" "Someday Maybe(s)" "Waiting(w)" "Planned(p)" "|" "CANCEL(c!)" "DONE(d!)")
    	  ))

    (setq org-refile-targets
    	'(("Archive.org" :maxlevel . 1)
    	  ("Tasks.org" :maxlevel . 1)
    	  ))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    ;;
    (setq org-tag-alist
    	'((:startgroup)
    	  ;; Put mutually exclusive tags here
    	  (:endgroup)
    	  ;;("@errand" . ?E)
    	  ;;("@home" . ?H)
    	  ;;("@work" . ?W)
    	  ;;("meeting" . ?m)
    	  ;;("planning" . ?p)
    	  ("teaching" . ?t)
    	  ("emacs" . ?e)
    	  ("HGC" . ?H)
    	  ("4b" . ?4)
    	  ("bbWW" . ?W)
    	  ;;("publish" . ?P)
    	  ("idea" . ?i)
    	  ("question" . ?q)
    	  ))


    ;; Configure custom agenda views
    (setq org-agenda-custom-commands
    	'(("d" "Dashboard"
    	   ((agenda "" ((org-deadline-warning-days 7)))
    	    (todo "The ONE thing"
    		  ((org-agenda-overriding-header "The ONE Thing")))
    	    (todo "Now"
    		  ((org-agenda-overriding-header "To do:")))
    	    (todo "Waiting"
    		  ((org-agenda-overriding-header "Waiting on")))
    	    (todo "TODO"
    		  ((org-agenda-overriding-header "On a Burner in the back of my mind")))  	    
    	    ;;(tags-todo "agenda/Waiting" ((org-agenda-overriding-header "Waiting on")))
    	    ))

    	  ("t" "To do"
    	   ((todo "TODO"
    		  ((org-agenda-overriding-header "Open Items")))))

    	  ("n" "To do now"
    	   ((todo "Now"
    		  ((org-agenda-overriding-header "Now:")))))


    	  ("o" "The ONE Thing"
    	   ((todo "The ONE thing"
    		  ((org-agenda-overriding-header "The ONE Thing")))))

    	  ("s" "Someday Maybe"
    	   ((todo "Someday Maybe"
    		  ((org-agenda-overriding-header "Someday Maybe")))))

    	  ;; The + [tag-name] means that the tag is required the - [tag-name] means that the tag is excluded
    	  ;;("W" "Work Tasks" tags-todo "+work-email")

    	  ))

    (setq org-capture-templates
    	`(("a" "Appointment" entry (file "~/RoamNotes/gcal.org" )
    	   "* %?")
    	  ("t" "Tasks / Projects")

    	  ;; %? is for the cursor /  %U is the time stamp  / %a is the link to the file / %i is the current region
    	  ;;("tt" "Task" entry (file+olp "~/RoamNotes/Tasks.org" "Inbox")
    	  ;; "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
    	  ("tt" "Task" entry (file "~/RoamNotes/Tasks.org")
             "* TODO %?\n  %U\n " :empty-lines 1)

    	  ("m", "Email Workflow")
    	  ("mf", "Follow Up" entry (file+olp "~/RoamNotes/Mail.org" "Follow Up")
    	   "* TODO %a\n\n %i"
    	   :immediate-finish t)

    	  ("mr", "Read Later" entry (file+olp "~/RoamNotes/Mail.org" "Read Later")
    	   "* TODO %a\n\n %i"
    	   :immediate-finish t))
    	)
    )

  (add-hook 'org-mode-hook 'abbrev-mode)


#+end_src



* Org mode Keybindings

 This unbinds the Alt-Left and Alt-Right keys in Org-mode, which will make them fall back to the global Emacs keybindings (moving by word).

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el
  					;
  (with-eval-after-load 'org
    (define-key org-mode-map (kbd "<M-left>") nil)
    (define-key org-mode-map (kbd "<backtab>") nil)
    (define-key org-mode-map (kbd "<M-right>") nil))


  #+end_src


* Nicer Heading Bullets

[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in org-mode buffers with nicer looking characters that you can control. 

#+begin_src emacs-lisp  :tangle ~/dotfiles/init-org.el

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("○" "-" "" "" "" "" "")))

    ;; Other options: "◉" "○" "●" "○" "●" "○" "●"
  
#+end_src


* Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document. 

#+begin_src emacs-lisp : tangle ~/dotfiles/init-org.el

  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 150
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))

#+end_src


