init-org.el
(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  ;(font-lock-add-keywords 'org-mode
  ;			  '(("^ *\\([-]\\) "
  ;			     (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))


  ;; Set faces for heading levels with colors
  ;;(set-face-attribute 'org-level-1 nil :font "Lucida Grande" :weight 'bold    :height 1.1 :foreground "#8350ef")
  (set-face-attribute 'org-level-1 nil :font "Lucida Grande" :weight 'bold    :height 1.1 :foreground "mediumblue")
  (set-face-attribute 'org-level-2 nil :font "Lucida Grande" :weight 'bold    :height 1.1 ) 
  (set-face-attribute 'org-level-3 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
  (set-face-attribute 'org-level-4 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
  (set-face-attribute 'org-level-5 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
  (set-face-attribute 'org-level-6 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
  (set-face-attribute 'org-level-7 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 
  (set-face-attribute 'org-level-8 nil :font "Lucida Grande" :weight 'regular :height 1.1 ) 

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit '(shadow fixed-pitch) :height 1.0)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch) :height 0.9)
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  )

(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  ;;(setq-default line-spacing 0.5) ;; 0.2 means 20% extra space
  (visual-line-mode 1))


(use-package org
  :hook (org-mode . efs/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (setq org-agenda-files
	'("~/RoamNotes/Tasks.org"
	  "~/RoamNotes/Mail.org"
	  "~/RoamNotes/Archive.org"
	  "~/RoamNotes/Birthdays.org"
	  "~/RoamNotes/gcal.org"
	  ))
  (setq org-hide-emphasis-markers t)
  (setq org-hide-block-startup t)
  (efs/org-font-setup)

  (setq org-insert-heading-respect-content t)
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)


  (setq org-todo-keywords
	'((sequence "TODO(t)" "The ONE thing(o)" "Now(n)" "Someday Maybe(s)" "Waiting(w)" "|" "CANCEL(c!)" "DONE(d!)")
	  ))

  (setq org-refile-targets
	'(("Archive.org" :maxlevel . 1)
	  ("Tasks.org" :maxlevel . 1)
	  ))

  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  ;;
  (setq org-tag-alist
	'((:startgroup)
					; Put mutually exclusive tags here
	  (:endgroup)
	  ;;("@errand" . ?E)
	  ;;("@home" . ?H)
	  ;;("@work" . ?W)
	  ;;("meeting" . ?m)
	  ;;("planning" . ?p)
	  ("teaching" . ?t)
	  ("emacs" . ?e)
	  ("HGC" . ?H)
	  ("4b" . ?4)
	  ("bbWW" . ?W)
	  ;;("publish" . ?P)
	  ("idea" . ?i)
	  ("question" . ?q)
	  ))


  ;; Configure custom agenda views
  (setq org-agenda-custom-commands
	'(("d" "Dashboard"
	   ((agenda "" ((org-deadline-warning-days 7)))
	    (todo "The ONE thing"
		  ((org-agenda-overriding-header "The ONE Thing")))
	    (todo "Now"
		  ((org-agenda-overriding-header "To do:")))
	    (todo "Waiting"
		  ((org-agenda-overriding-header "Waiting on")))
	    ;;(tags-todo "agenda/Waiting" ((org-agenda-overriding-header "Waiting on")))
	    ))

	  ("t" "To do"
	   ((todo "TODO"
		  ((org-agenda-overriding-header "Open Items")))))

	  ("n" "To do now"
	   ((todo "Now"
		  ((org-agenda-overriding-header "Now:")))))


	  ("o" "The ONE Thing"
	   ((todo "The ONE thing"
		  ((org-agenda-overriding-header "The ONE Thing")))))

	  ("s" "Someday Maybe"
	   ((todo "Someday Maybe"
		  ((org-agenda-overriding-header "Someday Maybe")))))

	  ;; The + [tag-name] means that the tag is required the - [tag-name] means that the tag is excluded
	  ;;("W" "Work Tasks" tags-todo "+work-email")

	  ))

  (setq org-capture-templates
	`(("a" "Appointment" entry (file "~/RoamNotes/gcal.org" )
	   "* %?")
	  ("t" "Tasks / Projects")

	  ;; %? is for the cursor /  %U is the time stamp  / %a is the link to the file / %i is the current region
	  ;;("tt" "Task" entry (file+olp "~/RoamNotes/Tasks.org" "Inbox")
	  ;; "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
	  ("tt" "Task" entry (file "~/RoamNotes/Tasks.org")
           "* TODO %?\n  %U\n " :empty-lines 1)

	  ("m", "Email Workflow")
	  ("mf", "Follow Up" entry (file+olp "~/RoamNotes/Mail.org" "Follow Up")
	   "* TODO %a\n\n %i"
	   :immediate-finish t)

	  ("mr", "Read Later" entry (file+olp "~/RoamNotes/Mail.org" "Read Later")
	   "* TODO %a\n\n %i"
	   :immediate-finish t))
	)
  )

;
(with-eval-after-load 'org
  (define-key org-mode-map (kbd "<M-left>") nil)
  (define-key org-mode-map (kbd "<backtab>") nil)
  (define-key org-mode-map (kbd "<M-right>") nil))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("○" "-" "" "" "" "" "")))

  ;; Other options: "◉" "○" "●" "○" "●" "○" "●"
