init.el

(setq remote-lpc-coffea4bees-path "/ssh:jda102@cmslpc-el9.fnal.gov:/uscms/home/jda102/nobackup/HH4b/Run3/coffea4bees/")

;; Example of using the variable
(defun open-lpc-coffea4bees ()
  "Open the remote HH4b directory on the LPC."
  (interactive)
  (find-file remote-lpc-coffea4bees-path))

(setq remote-falcon-coffea4bees-path "/ssh:jalison@falcon.phys.cmu.edu:/home/export/jalison/work/coffea4bees/python")

;; Example of using the variable
(defun open-falcon-coffea4bees ()
  "Open the remote HH4b directory on falcon.phys.cmu.edu"
  (interactive)
  (find-file remote-falcon-coffea4bees-path))

(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 150
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))
