Emacs.org
* Latex in Org mode

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (setq org-latex-create-formula-image-program 'dvipng) ;; or 'dvisvgm for SVG output
  (setq org-export-with-broken-links t)  ;; Allow all broken links
  (setq org-startup-with-latex-preview t)
  (setq org-startup-with-inline-images t)
  (setq org-image-actual-width '(300))
  
#+end_src

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  ;; adjust image size, scale, background, etc.
  (setq org-format-latex-options
        ;; (see C-h v org-format-latex-options for all settings)
        '(:foreground default :background default
          :scale 2.0   ; 1.0 = 100% size
          :html-foreground "Black" :html-background "Transparent"
          :html-scale 1.0))

#+end_src


* Org Calendar

Set the calendar to open in a side window at the top of the screen

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el
  
  (add-to-list 'display-buffer-alist
               '("\\*Calendar\\*"
                 (display-buffer-in-side-window)
                 (side . top)
                 (window-height . 20)))

#+end_src

Default show onnly one day

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (setq org-agenda-span 'day)
  
#+end_src



* Org Roam

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (define-prefix-command 'org-roam-prefix-map)
  (global-set-key (kbd "C-c n") 'org-roam-prefix-map)


  (use-package org-roam
    :ensure t
    :custom
    (org-roam-directory "~/RoamNotes")
    (org-roam-dailies-directory   "Journal/")
    (org-roam-completion-everywhere t)
    (org-roam-dailies-capture-templates
     '(("d" "default" entry
        (file "~/RoamNotes/Templates/DailyTemplate.org")
        :target (file+head "%<%Y/%m-%B/%d-%B-%Y-%A>.org" "#+title: %<%d %B %Y %A>\n")))
     )
    (org-roam-capture-templates
     '(("d" "default" plain
        "\n\n %?\n" :empty-lines-before 1
        :if-new (file+head "Notes/${slug}-%<%Y%m%d%H%M%S>.org" "#+title: ${title}\n")
        :unnarrowed t)))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           :map org-mode-map
           ("C-M-i"    . completion-at-point))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies) ;; Ensure the keymap is available
    ;; Configure backlinks buffer to always appear at the bottom
    (add-to-list 'display-buffer-alist
                 '("\\*org-roam\\*"
                   (display-buffer-in-side-window)
                   (side . bottom)
                   (slot . 0)
                   (window-width . 0.33)
                   (window-height . 0.4)
                   (window-parameters . ((no-delete-other-windows . t)))))
    (org-roam-setup))
  (org-roam-db-autosync-mode)

  (require 'org-roam-dailies)


#+end_src


* Org-roam Daily

Helper functions to open or create the daily

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (defun my/roam-dailies--today-filepath ()
    "Return the absolute path of today’s Org-roam daily note."
    (let* ((fname (format-time-string "%Y/%m-%B/%d-%B-%Y-%A.org" (current-time)))
           (dir   (expand-file-name org-roam-dailies-directory
                                    org-roam-directory)))
      (expand-file-name fname dir)))
    
#+end_src

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (defun my/roam-dailies-goto-or-capture-today ()
    "If today’s daily file exists, `goto` it; otherwise `capture` it."
    (interactive)
    (let ((file (my/roam-dailies--today-filepath)))
      ;; ensure the dailies directory is there
      (unless (file-directory-p (file-name-directory file))
        (make-directory (file-name-directory file) :parents))
      (if (file-exists-p file)
          ;; ── already there → just visit it ──
          (org-roam-dailies-goto-today)
        ;; ── absent → create via your capture template “d” ──
        (org-roam-dailies-capture-today))))

    
#+end_src

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (defun org-roam-dailies--list-files-recursively ()
    "List all Org files in `org-roam-dailies-directory' and its subdirectories."
    (let ((dailies-dir (expand-file-name org-roam-dailies-directory org-roam-directory)))
      (directory-files-recursively dailies-dir "\\.org$")))

  (advice-add 'org-roam-dailies--list-files :override #'org-roam-dailies--list-files-recursively)

#+end_src


** Daily Keybindings

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  ;(global-set-key (kbd "s-d") 'org-roam-dailies-goto-today)
  (global-set-key (kbd "s-d") 'my/roam-dailies-goto-or-capture-today)
  (global-set-key (kbd "s-c") 'org-roam-dailies-goto-date)
  (global-set-key (kbd "s-a") (lambda () (interactive) (org-agenda nil "d")))
  (global-set-key (kbd "C-s-{") 'org-roam-dailies-find-previous-note)
  (global-set-key (kbd "C-s-}") 'org-roam-dailies-find-next-note)
  (global-set-key (kbd "s-t") (lambda () (interactive) (org-capture nil "tt")))
  (global-set-key (kbd "s-q") 'org-roam-node-insert-immediate)
  (global-set-key (kbd "s-i") 'org-roam-node-insert)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-<tab>") 'org-shifttab)
  (global-set-key (kbd "C-c s") 'org-store-link)
    
#+end_src


** Org Agenda

Show *Org Agenda* in a right‑side window (≈ 50 % of the frame)

#+begin_src emacs-lisp  :tangle ~/dotfiles/init-org.el

  (add-to-list
   'display-buffer-alist
   '("^\\*Org Agenda\\*$"                           ; any agenda buffer
     (display-buffer-reuse-window                  ; ► first try to reuse…
      )               ; ► …else make a side‑window
     (side         . right)                        ; right edge of the frame
     (slot         . 0)                            ; topmost slot on that side
     (window-width . 0.50)                         ; half the frame’s width
     ;; optional niceties
     ;;(window-parameters . ((no-delete-other-windows . t) ; keep layout stable
     ;;                      ))
     )) ; M‐p / M‐n ignore
    
#+end_src


** Consult Org-roam

#+begin_src emacs-lisp  :tangle ~/dotfiles/init-org.el

  (use-package consult-org-roam
     :ensure t
     :after org-roam
     :init
     (require 'consult-org-roam)
     ;; Activate the minor mode
     (consult-org-roam-mode 1)
     :custom
     ;; Use `ripgrep' for searching with `consult-org-roam-search'
     ;(consult-org-roam-grep-func #'consult-ripgrep)
     ;; Configure a custom narrow key for `consult-buffer'
     (consult-org-roam-buffer-narrow-key ?r)
     ;; Display org-roam buffers right after non-org-roam buffers
     ;; in consult-buffer (and not down at the bottom)
     (consult-org-roam-buffer-after-buffers t)
     :config
     ;; Eventually suppress previewing for certain functions
     (consult-customize
      consult-org-roam-forward-links
      :preview-key "M-.")
     :bind
     ;; Define some convenient keybindings as an addition
     ("C-c n e" . consult-org-roam-file-find)
     ("C-c n b" . consult-org-roam-backlinks)
     ("C-c n B" . consult-org-roam-backlinks-recursive)
     ("C-c n b" . consult-org-roam-backlinks)     
     ("C-c n l" . consult-org-roam-forward-links)
     ("C-c n g" . consult-org-roam-search)
     )
    
#+end_src


* Setup Git Auto Commits

Auto git every hour

#+begin_src emacs-lisp  :tangle ~/dotfiles/init-org.el

  (defun my/org-notes-auto-commit ()
    "Auto-commit and push all changes in the notes repository, including untracked files."
    (let ((default-directory "~/RoamNotes")) ;; Replace with your notes repo path
      (when (file-directory-p default-directory)
        (require 'magit)
        ;; Save all modified buffers before Git actions
        (save-some-buffers t)
        ;; Stage all changes
        (magit-run-git "add" "-A")
        ;; Commit only if something is staged
        (when (magit-staged-files)
          (magit-commit-create
           `("-m" ,(format "Auto-commit notes: %s" (format-time-string "%F %T"))))
  	(magit-push-current-to-pushremote nil)))))

  (run-at-time "0 min" 3600 #'my/org-notes-auto-commit)

#+end_src


