init-org.el

(defun my/org-open-at-point-no-select ()
  "Open the Org link at point but keep focus in the current window."
  (interactive)
  (save-selected-window
    (org-open-at-point)))

;; rebind C-c p in Org mode to our new version
(with-eval-after-load 'org
  (define-key org-mode-map (kbd "C-c p") #'my/org-open-at-point-no-select))

(defun my/org-open-at-point-no-select-mouse (event)
  "Call my/org-open-at-point-no-select at the position of mouse click EVENT."
  (interactive "e")
  (let* ((pos (event-start event))
         (window (posn-window pos))
         (buffer (window-buffer window))
         (position (posn-point pos)))
    (with-current-buffer buffer
      (goto-char position)
      (my/org-open-at-point-no-select))))

(global-set-key [M-S-mouse-1] 'my/org-open-at-point-no-select-mouse)

(require 'org-contacts)
(setq org-contacts-files '("~/RoamNotes/Contacts.org"))

(defun jda/org-contacts-groups ()
  "Return a list of all unique group names in org-contacts."
  (let ((groups '()))
    (org-map-entries
     (lambda ()
       (let ((contact-groups (org-entry-get nil "GROUP")))
         (when contact-groups
           (dolist (group (split-string contact-groups))
             (add-to-list 'groups group)))))
     nil
     (org-contacts-files))
    groups))


(defun jda/get-group-emails (group)
  "Return a list of emails for contacts in GROUP."
  (let ((emails '()))
    (org-map-entries
     (lambda ()
       (let ((contact-groups (org-entry-get nil "GROUP"))
             (email (org-entry-get nil "EMAIL")))
	 (when (and contact-groups email
                    (string-match (regexp-quote group) contact-groups))
           (push email emails))))
     nil
     (org-contacts-files))
    emails))


(defun jda/insert-group-emails (group)
  "Insert comma-separated list of emails for GROUP.
 With completion for available groups."
  (interactive
   (list (completing-read "Group name: " (jda/org-contacts-groups))))
  (let ((emails (jda/get-group-emails group)))
    (insert (mapconcat 'identity emails ", "))))

(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (python . t)))

(setq org-babel-python-command "/opt/homebrew/bin/python3")
(setq org-confirm-babel-evaluate nil)


(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))

(require 'plstore)
(add-to-list 'plstore-encrypt-to "D37214566A581BF2")


(setq plstore-cache-passphrase-for-symmetric-encryption t)

(setq org-gcal-client-id "57759006028-j8fafbn9prevdvjihbrf7hslpf0g09aa.apps.googleusercontent.com"
      org-gcal-client-secret (efs/lookup-password :host "org-gal-client")
      org-gcal-fetch-file-alist '(("johnda102@gmail.com" .  "~/RoamNotes/gcal.org")))

(require 'org-gcal)
(setq org-gcal-auto-archive t)
(setq org-gcal-remove-api-cancelled-events t)

;;(add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync)))
;;(add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync)))
