Emacs.org
* Mu4e

Email


#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  ;; adjust path if needed
  (add-to-list 'load-path "/opt/homebrew/share/emacs/site-lisp/mu/mu4e") 
    
#+end_src

Org-mail captures

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (defun efs/capture-mail-follow-up (msg)
    "Capture a follow-up task from an email."
    (interactive)
    (call-interactively 'org-store-link)
    (org-capture nil "mf"))

  (defun efs/capture-mail-read-later (msg)
    "Capture a readlater task from an email."
    (interactive)
    (call-interactively 'org-store-link)
    (org-capture nil "mr"))

    
#+end_src

Main setup

Testing [[https://github.com/armindarvish/consult-mu][consult-mu]]  Nice way to search email quickly

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el

  (use-package mu4e
    :ensure nil
    ;:load-path "/opt/homebrew/share/emacs/site-lisp/mu/mu4e"
    :defer 20 ; Wait until 20 seconds after startup
    :bind(:map mu4e-search-minor-mode-map
  	     ("M-<right>" . right-word)
  	     ("M-<left>" .  left-word)
  	     )
    :bind(:map mu4e-compose-mode-map
    	         ("M-n" .  forward-paragraph)
  	     ("M-p" .  backward-paragraph)
  	     )

    :config
    (require 'mu4e-org)
    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)

    ;; Refresh mail using isync every 30 minutes
    (setq mu4e-update-interval (* 30 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail")
    (setq mu4b-mu-binary "/opt/homebrew/bin/mu")
    (setq user-mail-address  "johnalison@cmu.edu")
    (setq mu4e-drafts-folder "/[Gmail]/Drafts")
    (setq mu4e-sent-folder   "/[Gmail]/Sent Mail")
    (setq mu4e-refile-folder "/[Gmail]/All Mail")
    (setq mu4e-trash-folder  "/[Gmail]/Trash")
    ;;(setq mu4e-compose-format-flowed t)
    (setq mu4e-compose-format-flowed nil)
    (setq mu4e-compose-signature nil)
    (setq mu4e-attachment-dir "~/Downloads")

    (setq mu4e-headers-show-threads nil)      ;; Main option to disable threading
    (setq mu4e-headers-include-related nil)   ;; Don't include related messages
    (setq mu4e-headers-skip-duplicates nil)   ;; Show all messages, even duplicates


    ;; Add custom actions for our capture templates
    (add-to-list 'mu4e-headers-actions
  	       '("follow up" . efs/capture-mail-follow-up) t)
    (add-to-list 'mu4e-view-actions
  	       '("follow up" . efs/capture-mail-follow-up) t)
    (add-to-list 'mu4e-headers-actions
  	       '("read later" . efs/capture-mail-read-later) t)
    (add-to-list 'mu4e-view-actions
  	       '("read later" . efs/capture-mail-read-later) t)


    (setq mu4e-bookmarks
  	'(("flag:unread AND NOT flag:trashed" "Unread messages"      ?i)
  	  ("flag:flagged AND NOT flag:trashed"                     "Flagged"             ?f)
  	  ("maildir:\"/Inbox\" and date:today..now AND NOT flag:trashed"                  "Today's messages"     ?t)
  	  ("maildir:\"/Inbox\" and date:7d..now AND NOT flag:trashed"                  "This Weeks's messages"     ?w)
  	  ("maildir:\"/Inbox\" and date:30d..now AND NOT flag:trashed"                  "This Months's messages"     ?m)
  	))


    (setq mu4e-maildir-shortcuts
        '(("/Inbox"             . ?i)
          ("/[Gmail]/Sent Mail" . ?s)
          ("/[Gmail]/Trash"     . ?t)
          ;;("/[Gmail]/Important" . ?m)
          ("/[Gmail]/Drafts"    . ?d)
          ("/[Gmail]/All Mail"  . ?a)))

    (setq
     message-send-mail-function 'smtpmail-send-it
     smtpmail-smtp-user "johnda102@gmail.com"
     smtpmail-smtp-server "smtp.gmail.com"
     smtpmail-smtp-service 587
     smtpmail-stream-type 'starttls
     smtpmail-auth-credentials "~/.authinfo.gpg")


    (mu4e t)
    )

    
#+end_src

#+begin_src emacs-lisp

  (use-package consult-mu
    :load-path ("~/emacs/consult-mu" "~/emacs/consult-mu/extras")
    :after (consult mu4e)
    :custom
    ;;maximum number of results shown in minibuffer
    (consult-mu-maxnum 200)
    ;;show preview when pressing any keys
    (consult-mu-preview-key 'any)
    ;;do not mark email as read when previewed
    (consult-mu-mark-previewed-as-read nil)
    ;; do not amrk email as read when selected. This is a good starting point to ensure you would
    ;; not miss important emails marked as read by mistake especially when trying this package out.
    ;;  Later you can change this to t.
    (consult-mu-mark-viewed-as-read nil)
    ;; open the message in mu4e-view-buffer when selected.
    (consult-mu-action #'consult-mu--view-action)

    :config
    ;;create a list of saved searches for quick access using `histroy-next-element'
    ;; with `M-n' in minibuffer. Note the "#" character at the beginning of each query! Change these according to
    (setq consult-mu-saved-searches-dynamics '("#flag:unread"))
    (setq consult-mu-saved-searches-async '("#flag:unread"))
    ;; require extra module for searching contacts and runing embark actions on contacts
    (require 'consult-mu-contacts)
    (setq consult-mu-contacts-ignore-list '("^.*no.*reply.*"))
    (setq consult-mu-contacts-ignore-case-fold-search t)
    )

#+end_src

* Helper Functions

Zoom link

#+begin_src emacs-lisp

  (define-abbrev global-abbrev-table "myzoom" "https://cmu.zoom.us/j/4126571061")
  (define-abbrev global-abbrev-table "yield" "yeild")

#+end_src



* Languages

Fly check

#+begin_src emacs-lisp

  (use-package flycheck
    :ensure t
    :init (global-flycheck-mode))
    
#+end_src

** Language Servers

#+begin_src emacs-lisp

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t)

;;    ;; Essential for TRAMP
;;    (setq lsp-auto-guess-root t)
;;    (setq lsp-enable-file-watchers nil)
;;    (setq lsp-response-timeout 30)
;;
;;    ;; Enable TRAMP support
;;    (lsp-register-client
;;     (make-lsp-client :new-connection (lsp-tramp-connection "pylsp")
;;                      :major-modes '(python-mode)
;;                      :remote? t
;;                      :server-id 'pylsp-tramp))
    )

#+end_src




** Python
 
#+begin_src emacs-lisp

  (use-package python-mode
    :ensure nil
    :hook (python-mode . lsp-deferred)
    :bind (:map python-mode-map
  	      :package python
                ("<backtab>" . dabbrev-expand))
    )


  (use-package pyvenv
    :config
    (pyvenv-mode 1))


  (add-hook 'python-mode-hook (lambda () (company-mode -1)))


  (use-package lsp-mode
    :ensure t
    :commands (lsp lsp-deferred)
    :custom
    ;; Configure pylsp to use pylint
    (lsp-completion-enable nil)

    (lsp-pylsp-plugins-pylint-enabled t)
    (lsp-pylsp-plugins-flake8-enabled nil)

    (lsp-pylsp-plugins-autopep8-enabled t) ;; Turn on for code style
    (lsp-pylsp-plugins-black-enabled nil)
    (lsp-pylsp-plugins-yapf-enabled nil)

    (lsp-pylsp-plugins-pycodestyle-enabled nil)
    (lsp-pylsp-plugins-pyflakes-enabled nil)
    (lsp-pylsp-plugins-pylint-args ["--max-line-length=88" "--disable=C0103"]))

#+end_src


** Company

#+begin_src emacs-lisp
   
;;;    (use-package company
;;;      :after lsp-mode
;;;      :hook (prog-mode . company-mode)
;;;      :bind (:map company-active-map
;;;  		("<tab>" . company-complete-selection)
;;;  		("C-h" .   nil)
;;;  		("C-?" .   company-show-doc-buffer)
;;;  		)
;;;            (:map lsp-mode-map
;;;             ("<tab>" . company-indent-or-complete-common))
;;;      :custom
;;;      (company-minimum-prefix-length 1)
;;;      (company-idle-delay 0.0))
;;;
;;;  ;;   (use-package company-box
;;;  ;;    :hook (company-mode . company-box-mode))
      
#+end_src


* Emacs vs Emacs -nw config

#+begin_src emacs-lisp
      ;;:init (load-theme 'modus-operandi t)))

  (unless (eq window-system nil)
    (use-package doom-themes
      :init (load-theme 'modus-operandi-tritanopia t)))

  (unless (eq window-system nil)
    (load "~/dotfiles/init-org.el"))
    
#+end_src


