init-org.el

;; adjust path if needed
(add-to-list 'load-path "/opt/homebrew/share/emacs/site-lisp/mu/mu4e")

(defun efs/capture-mail-follow-up (msg)
  "Capture a follow-up task from an email."
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil "mf"))

(defun efs/capture-mail-read-later (msg)
  "Capture a readlater task from an email."
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil "mr"))

(use-package mu4e
  :ensure nil
  ;:load-path "/opt/homebrew/share/emacs/site-lisp/mu/mu4e"
  :defer 20 ; Wait until 20 seconds after startup
  :bind(:map mu4e-search-minor-mode-map
	     ("M-<right>" . right-word)
	     ("M-<left>" .  left-word)
	     )
  :bind(:map mu4e-compose-mode-map
  	         ("M-n" .  forward-paragraph)
	     ("M-p" .  backward-paragraph)
	     )

  :config
  (require 'mu4e-org)
  ;; This is set to 't' to avoid mail syncing issues when using mbsync
  (setq mu4e-change-filenames-when-moving t)

  ;; Refresh mail using isync every 30 minutes
  (setq mu4e-update-interval (* 30 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Mail")
  (setq mu4b-mu-binary "/opt/homebrew/bin/mu")
  (setq user-mail-address  "johnalison@cmu.edu")
  (setq mu4e-drafts-folder "/[Gmail]/Drafts")
  (setq mu4e-sent-folder   "/[Gmail]/Sent Mail")
  (setq mu4e-refile-folder "/[Gmail]/All Mail")
  (setq mu4e-trash-folder  "/[Gmail]/Trash")
  (setq mu4e-compose-format-flowed t)
  (setq mu4e-compose-signature nil)
  (setq mu4e-attachment-dir "~/Downloads")

  (setq mu4e-headers-show-threads nil)      ;; Main option to disable threading
  (setq mu4e-headers-include-related nil)   ;; Don't include related messages
  (setq mu4e-headers-skip-duplicates nil)   ;; Show all messages, even duplicates


  ;; Add custom actions for our capture templates
  (add-to-list 'mu4e-headers-actions
	       '("follow up" . efs/capture-mail-follow-up) t)
  (add-to-list 'mu4e-view-actions
	       '("follow up" . efs/capture-mail-follow-up) t)
  (add-to-list 'mu4e-headers-actions
	       '("read later" . efs/capture-mail-read-later) t)
  (add-to-list 'mu4e-view-actions
	       '("read later" . efs/capture-mail-read-later) t)


  (setq mu4e-bookmarks
	'(("flag:unread AND NOT flag:trashed" "Unread messages"      ?i)
	  ("flag:flagged AND NOT flag:trashed"                     "Flagged"             ?f)
	  ("maildir:\"/Inbox\" and date:today..now AND NOT flag:trashed"                  "Today's messages"     ?t)
	  ("maildir:\"/Inbox\" and date:7d..now AND NOT flag:trashed"                  "This Weeks's messages"     ?w)
	  ("maildir:\"/Inbox\" and date:30d..now AND NOT flag:trashed"                  "This Months's messages"     ?m)
	))


  (setq mu4e-maildir-shortcuts
      '(("/Inbox"             . ?i)
        ("/[Gmail]/Sent Mail" . ?s)
        ("/[Gmail]/Trash"     . ?t)
        ;;("/[Gmail]/Important" . ?m)
        ("/[Gmail]/Drafts"    . ?d)
        ("/[Gmail]/All Mail"  . ?a)))

  (setq
   message-send-mail-function 'smtpmail-send-it
   smtpmail-smtp-user "johnda102@gmail.com"
   smtpmail-smtp-server "smtp.gmail.com"
   smtpmail-smtp-service 587
   smtpmail-stream-type 'starttls
   smtpmail-auth-credentials "~/.authinfo.gpg")


  (mu4e t)
  )
