init.el

(use-package consult-mu
  :load-path ("~/emacs/consult-mu" "~/emacs/consult-mu/extras")
  :after (consult mu4e)
  :custom
  ;;maximum number of results shown in minibuffer
  (consult-mu-maxnum 200)
  ;;show preview when pressing any keys
  (consult-mu-preview-key 'any)
  ;;do not mark email as read when previewed
  (consult-mu-mark-previewed-as-read nil)
  ;; do not amrk email as read when selected. This is a good starting point to ensure you would
  ;; not miss important emails marked as read by mistake especially when trying this package out.
  ;;  Later you can change this to t.
  (consult-mu-mark-viewed-as-read nil)
  ;; open the message in mu4e-view-buffer when selected.
  (consult-mu-action #'consult-mu--view-action)

  :config
  ;;create a list of saved searches for quick access using `histroy-next-element'
  ;; with `M-n' in minibuffer. Note the "#" character at the beginning of each query! Change these according to
  (setq consult-mu-saved-searches-dynamics '("#flag:unread"))
  (setq consult-mu-saved-searches-async '("#flag:unread"))
  ;; require extra module for searching contacts and runing embark actions on contacts
  (require 'consult-mu-contacts)
  (setq consult-mu-contacts-ignore-list '("^.*no.*reply.*"))
  (setq consult-mu-contacts-ignore-case-fold-search t)
  )

(define-abbrev global-abbrev-table "myzoom" "https://cmu.zoom.us/j/4126571061")
(define-abbrev global-abbrev-table "yield" "yeild")

(use-package flycheck
  :ensure t
  :init (global-flycheck-mode))

(use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t)

;;    ;; Essential for TRAMP
;;    (setq lsp-auto-guess-root t)
;;    (setq lsp-enable-file-watchers nil)
;;    (setq lsp-response-timeout 30)
;;
;;    ;; Enable TRAMP support
;;    (lsp-register-client
;;     (make-lsp-client :new-connection (lsp-tramp-connection "pylsp")
;;                      :major-modes '(python-mode)
;;                      :remote? t
;;                      :server-id 'pylsp-tramp))
    )

(use-package python-mode
  :ensure nil
  :hook (python-mode . lsp-deferred)
  :bind (:map python-mode-map
	      :package python
              ("<backtab>" . dabbrev-expand))
  )


(use-package pyvenv
  :config
  (pyvenv-mode 1))


(add-hook 'python-mode-hook (lambda () (company-mode -1)))


(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :custom
  ;; Configure pylsp to use pylint
  (lsp-completion-enable nil)

  (lsp-pylsp-plugins-pylint-enabled t)
  (lsp-pylsp-plugins-flake8-enabled nil)

  (lsp-pylsp-plugins-autopep8-enabled t) ;; Turn on for code style
  (lsp-pylsp-plugins-black-enabled nil)
  (lsp-pylsp-plugins-yapf-enabled nil)

  (lsp-pylsp-plugins-pycodestyle-enabled nil)
  (lsp-pylsp-plugins-pyflakes-enabled nil)
  (lsp-pylsp-plugins-pylint-args ["--max-line-length=88" "--disable=C0103"]))

;;;    (use-package company
;;;      :after lsp-mode
;;;      :hook (prog-mode . company-mode)
;;;      :bind (:map company-active-map
;;;  		("<tab>" . company-complete-selection)
;;;  		("C-h" .   nil)
;;;  		("C-?" .   company-show-doc-buffer)
;;;  		)
;;;            (:map lsp-mode-map
;;;             ("<tab>" . company-indent-or-complete-common))
;;;      :custom
;;;      (company-minimum-prefix-length 1)
;;;      (company-idle-delay 0.0))
;;;
;;;  ;;   (use-package company-box
;;;  ;;    :hook (company-mode . company-box-mode))

;;:init (load-theme 'modus-operandi t)))

(unless (eq window-system nil)
  (use-package doom-themes
    :init (load-theme 'modus-operandi-tritanopia t)))

(unless (eq window-system nil)
  (load "~/dotfiles/init-org.el"))
