Emacs.org
* Auto-tangle configuration files

This snippet adds a hook to org-mode buffers so that efs/org-babel-tangle-config gets executed each time such a buffer gets saved. This function checks to see if the file being saved is the Emacs.org file you’re looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp :tangle ~/dotfiles/init-org.el
  
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/dotfiles/Emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

#+end_src


* World Clock

#+begin_src emacs-lisp

  (setq world-clock-list
        '(("America/New_York" "Pittsburgh")
          ("Europe/Zurich" "CERN")
          ("America/Chicago" "Chicago")
  	("America/Los_Angeles" "Santa Barbara")
          ("Asia/Shanghai" "China")))


#+end_src
