init.el

(setq world-clock-list
      '(("America/New_York" "Pittsburgh")
        ("Europe/Zurich" "CERN")
        ("America/Chicago" "Chicago")
	("America/Los_Angeles" "Santa Barbara")
        ("Asia/Shanghai" "China")))
